BOQ/src/InformationRegisters/ОчередиОбработкиДокументации/ОчередиОбработкиДокументации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередиОбработкиДокументации</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ИдентификаторМодели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусОбработки</name>
    <type>
      <types>EnumRef.СтатусыОбработкиДокументации</types>
    </type>
  </resources>
  <resources>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документация</name>
    <type>
      <types>DocumentRef.ПроектнаяДокументацияНаИзделие</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BOQ/src/Enums/СтатусыОбработкиДокументации/СтатусыОбработкиДокументации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОбработкиДокументации</name>
  <enumValues>
    <name>Трансляция</name>
  </enumValues>
  <enumValues>
    <name>СохранениеБД</name>
  </enumValues>
  <enumValues>
    <name>Завершена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

BOQ/src/InformationRegisters/ОчередиОбработкиДокументации/ManagerModule.bsl
Процедура ЗаписатьСтатусОбработки ( Документация, ИдентификаторМодели, Статус ) Экспорт
	
	менеджер = РегистрыСведений.ОчередиОбработкиДокументации.СоздатьМенеджерЗаписи ();
	менеджер.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	менеджер.Документация = Документация;
	менеджер.ИдентификаторМодели = ИдентификаторМодели;
	менеджер.СтатусОбработки = Статус;
	менеджер.Завершен = ( Статус = Перечисления.СтатусыОбработкиДокументации.Завершена );
	менеджер.Период = ТекущаяДата ();
	менеджер.Записать ();
	
КонецПроцедуры

Функция ПолучитьРесурсы ( Документация, Пользователь = Неопределено ) Экспорт
	
	с = "
	|выбрать 
	|	ИдентификаторМодели как ИдентификаторМодели,
	|	СтатусОбработки как СтатусОбработки,
	|	Завершен как Завершен
	|из РегистрСведений.ОчередиОбработкиДокументации.СрезПоследних (  , Пользователь = &Пользователь
	|																   и Документация = &Документация )
	|";
	запрос = Новый Запрос ( с );
	запрос.УстановитьПараметр ( "Пользователь", ? ( Пользователь = Неопределено, ПараметрыСеанса.ТекущийПользователь, Пользователь ) );
	запрос.УстановитьПараметр ( "Документация", Документация );
	результат = запрос.Выполнить ();
	выборка = результат.Выбрать ();
	п = Новый Структура ();
	п.Вставить ( "ИдентификаторМодели", "" );
	п.Вставить ( "СтатусОбработки", Неопределено );
	п.Вставить ( "Завершен", Ложь );
	Пока ( выборка.Следующий () ) Цикл
		п.ИдентификаторМодели = выборка.ИдентификаторМодели;
		п.СтатусОбработки = выборка.СтатусОбработки;
		п.Завершен = выборка.Завершен;
	КонецЦикла; 
	Возврат п;

КонецФункции
